'''
#Дано дійсне число a. З’ясувати, чи належать це число інтервалу (3;7) [8;9) (11;22.4)
'''
# позначення
'''
Довільне число - float - number_a
'''
import math
# ввід
number_a = float(input('довільне число='))
#перевірка
if 3<number_a<7:
    print('належить інтервалу (3;7)')
elif 8<=number_a<9:
    print('належить інтервалу[8;9)')
elif 11<number_a<22.4:
    print('належить інтервалу(11;22.4)')
else:
    print('other')